<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=3]
data.assert_test.workspace: Read complete after 0s
aws_s3_bucket.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.backup_dns.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.aws_iam_access_key.prometheus_proxy_key: Refreshing state... [id=AKIA5COABPQXZKCYHEMI]
module.logging.aws_s3_bucket.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.ecs.aws_iam_policy.geoip_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_geoip_bucket_access]
module.ecs.aws_iam_user.prometheus_proxy: Refreshing state... [id=prometheus_sigv4_proxy_staging_rpc-proxy]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.backup_dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/01db5774-a887-4ef5-bd91-ba53f7d482f5]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.data.aws_ecr_image.service_image: Reading...
aws_kms_key.analytics_bucket: Refreshing state... [id=6bfc377d-7703-430c-ab6f-ccdc2c595e8d]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/b0653f13-6cc0-4285-9977-f3921aff8ab4]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-bbafeb15-8e6b-4c49-a272-7b9f5b454692]
module.ecs.data.aws_ecr_image.service_image: Read complete after 0s [id=sha256:02c73c231127dc7bb1be8c78937635f5396392e1b240d16a89192daed8c2d597]
data.aws_ecr_repository.repository: Reading...
module.backup_dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z025697917GKV1T3MTR7I]
module.ecs.data.aws_vpc.vpc: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z09669243E0Q6ZCWCIW2U]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
module.redis.data.aws_vpc.vpc: Reading...
module.backup_dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z025697917GKV1T3MTR7I__4d22d935f4bfd18f85fd77a386484a45.staging.rpc.walletconnect.org._CNAME]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946444300000003]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946808400000005]
module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946907600000006]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946627800000004]
module.ecs.aws_iam_role_policy_attachment.attachment: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531182117939400000001]
aws_kms_alias.analytics_bucket: Refreshing state... [id=alias/analytics/rpc-proxy/staging]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=4]
data.aws_ecr_repository.repository: Read complete after 1s [id=rpc-proxy]
module.ecs.data.aws_vpc.vpc: Read complete after 1s [id=vpc-09dce0b23af575478]
module.redis.data.aws_vpc.vpc: Read complete after 1s [id=vpc-09dce0b23af575478]
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-0ac7678fe5cb03d2c]
module.ecs.aws_security_group.sigv4_proxy_vpc_ingress: Refreshing state... [id=sg-03a9fb9aed01c7eac]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-08dd28bde6f2433a8]
module.ecs.aws_security_group.vpc-endpoint-group: Refreshing state... [id=sg-04f494daf08e2b676]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-5b3/162d6f2524f3d01b]
module.ecs.data.aws_subnets.private_subnets: Reading...
module.redis.data.aws_subnets.private_subnets: Reading...
module.ecs.aws_security_group.tls_ingress: Refreshing state... [id=sg-05bbe738c981c03fd]
module.ecs.data.aws_subnets.public_subnets: Reading...
module.logging.aws_s3_bucket_public_access_block.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_acl.logging_bucket-acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs,log-delivery-write]
module.logging.data.aws_iam_policy_document.allow_logging_service: Reading...
module.logging.data.aws_iam_policy_document.allow_logging_service: Read complete after 0s [id=3646663536]
module.logging.aws_s3_bucket_server_side_encryption_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_lifecycle_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_versioning.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
aws_s3_bucket_versioning.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_acl.analytics-data-lake_acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake,private]
aws_s3_bucket_public_access_block.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_logging.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.logging.aws_s3_bucket_policy.allow_logging_service: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.ecs.data.aws_subnets.public_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.aws_iam_policy.analytics-data-lake_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_analytics-data-lake_bucket_access]
module.ecs.aws_vpc_endpoint.prometheus: Refreshing state... [id=vpce-0ad13a88fb4c91ca9]
module.redis.data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-c1c/31a81479cdf3c9dc]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=rpc-proxy-rpc-staging-private-subnet-group]
module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531151148871800000002]
module.ecs.aws_route53_record.backup_dns_load_balancer: Refreshing state... [id=Z025697917GKV1T3MTR7I_staging.rpc.walletconnect.org_A]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-c1c/31a81479cdf3c9dc/e74dba939acf5741]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=rpc-proxy-rpc-staging]
module.ecs.aws_lb_listener_certificate.backup_cert: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-c1c/31a81479cdf3c9dc/e74dba939acf5741_arn:aws:acm:eu-central-1:898587786287:certificate/01db5774-a887-4ef5-bd91-ba53f7d482f5]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=0:staging_rpc-proxy]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_appautoscaling_policy.memory_scaling: Refreshing state... [id=staging_rpc-proxy-application-scaling-policy-memory]
module.ecs.aws_appautoscaling_policy.cpu_scaling: Refreshing state... [id=staging_rpc-proxy-application-scaling-policy-cpu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        tags               = {}
      ~ tags_all           = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:107" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:107" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_rpc-proxy" -> (known after apply)
      ~ revision                 = 107 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_access_key.prometheus_proxy_key will be destroyed
  # (because aws_iam_access_key.prometheus_proxy_key is not in configuration)
  - resource "aws_iam_access_key" "prometheus_proxy_key" {
      - create_date          = "2023-05-31T18:21:17Z" -> null
      - id                   = "AKIA5COABPQXZKCYHEMI" -> null
      - secret               = (sensitive value) -> null
      - ses_smtp_password_v4 = (sensitive value) -> null
      - status               = "Active" -> null
      - user                 = "prometheus_sigv4_proxy_staging_rpc-proxy" -> null
    }

  # module.ecs.aws_iam_user.prometheus_proxy will be destroyed
  # (because aws_iam_user.prometheus_proxy is not in configuration)
  - resource "aws_iam_user" "prometheus_proxy" {
      - arn           = "arn:aws:iam::898587786287:user/prometheus/prometheus_sigv4_proxy_staging_rpc-proxy" -> null
      - force_destroy = false -> null
      - id            = "prometheus_sigv4_proxy_staging_rpc-proxy" -> null
      - name          = "prometheus_sigv4_proxy_staging_rpc-proxy" -> null
      - path          = "/prometheus/" -> null
      - tags          = {} -> null
      - tags_all      = {
          - "Application"      = "rpc-proxy"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - unique_id     = "AIDA5COABPQXXP6VFYQNP" -> null
    }

Plan: 1 to add, 2 to change, 3 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*